Revit 2024 API
ParameterFilterUtilities Class
 Contains static utility functions for enumerating the categories and parameters that are available for use by ParameterFilterElement objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static class ParameterFilterUtilities
Visual Basic
Public NotInheritable Class ParameterFilterUtilities
Visual C++
public ref class ParameterFilterUtilities abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterFilterUtilities
See Also
ParameterFilterUtilities Members
Autodesk.Revit.DB Namespace